//index.js
//获取应用实例
const app = getApp()

Page({
  data: {
    acceptData: {},
    // 📒写字
    courses: {
      '星期一': ['📚数学', '📚语文', '‍⚽体育', '📚英语', '--------', '🎨美术', '📚语文'],
      '星期二': ['📚数学', '📚语文', '📚语文', '📒写字', '--------', '🎵音乐', '⚽体育'],
      '星期三': ['📚语文', '🔭科学', '⚽体育', '🎵音乐', '--------', '', ''],
      '星期四': ['📚数学', '⚽地方', '📚语文', '🔰品生', '--------', '🧘‍舞(单)', '📑校本', '⛹️‍体活'],
      '星期五': ['📚数学', '📚语文', '🔰品生', '⚽体育', '--------', '🙎‍班会', '🎨美术'],
      '星期六': ['😝无😝'],
      '星期日': ['😝无😝']
    }
  },
  //事件处理函数
  onLoad: function (options) {
    //将字符串转换成对象  model即为上个js中传递的key
    var objectModel = JSON.parse(options.model);
    this.setData({
      acceptData: objectModel
    })
  },
})
